app/controllers/tasks_controller.rb

  def show
    @task = Task.find(params[:id].to_i)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @task = Task.new(name: params[:task][:name], description:params[:task][:description])
    if @task.save
---
INSERT INTO "tasks" ("title", "description", "due_date", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "asdf"], ["description", "asdfgjh"], ["due_date", "2017-09-15"], ["status", "f"], ["created_at", "2017-09-20 22:45:20.905613"], ["updated_at", "2017-09-20 22:45:20.905613"]]

  def edit
    @task = Task.find_by(id: params[:id].to_i)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def destroy
    @task = Task.find(params[:id].to_i).destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 2]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    task = Task.find_by(id: params[:id].to_i)
    task.name = params[:task][:name]
    task.description = params[:task][:description]
    task.completion_date = params[:task][:completion_date]
    task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "tasks" ("title", "description", "due_date", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
UPDATE "tasks" SET "title" = ?, "description" = ?, "due_date" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "Sit"], ["description", "20 minutes"], ["due_date", "2017-09-29"], ["updated_at", "2017-09-21 16:50:30.130269"], ["id", 5]]